InformationRegisters/ИсторияИспользованияШаблонаЭтикеткиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИспользованияШаблонаЭтикеткиИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ШаблонЭтикеткиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКодовМаркировкиСУЗ</v8:Type>
						<v8:Type>cfg:EnumRef.ШаблоныКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИспользованияШаблонаЭтикеткиИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ИзменениеДанных

Функция ИнициализироватьТаблицуДляЗаписиДанных() Экспорт
	
	ТаблицаДляЗаписиДанных = Новый ТаблицаЗначений;
	ТаблицаДляЗаписиДанных.Колонки.Добавить("Номенклатура",     Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ТаблицаДляЗаписиДанных.Колонки.Добавить("Характеристика",   Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ТаблицаДляЗаписиДанных.Колонки.Добавить("GTIN",             Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ТаблицаДляЗаписиДанных.Колонки.Добавить("Шаблон",           Новый ОписаниеТипов("СправочникСсылка.ШаблоныКодовМаркировкиСУЗ"));
	ТаблицаДляЗаписиДанных.Колонки.Добавить("ШаблонЭтикетки",   Метаданные.ОпределяемыеТипы.ШаблонЭтикеткиИС.Тип);
	
	Возврат ТаблицаДляЗаписиДанных;
	
КонецФункции

Процедура ЗаписатьДанные(ТаблицаДляЗаписиДанных) Экспорт
	
	Если ТаблицаДляЗаписиДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаЗаписей = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаЗаписей.Добавить("РегистрСведений.ИсторияИспользованияШаблонаЭтикеткиИСМП");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаДляЗаписиДанных;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура",   "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика", "Характеристика");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("GTIN",           "GTIN");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Шаблон",         "Шаблон");
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаЗаписей.Заблокировать();
		
		Для Каждого СтрокаДанных Из ТаблицаДляЗаписиДанных Цикл
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
			Запись.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
